# Exercise 3: Data definition with SQL

In this exercise you will familiarize yourself with some of the DDL operations: creating and modifying tables and attributes.

- Load the SQL module

In [1]:
%load_ext sql

- Connect to the PostgreSQL database:  
```python
%sql postgresql://username:password@server_address/database_name
```
  When using docker, the code below should be working.
  If you use a local installation, you may need to change the line usually to:
  - postgresql://user:\[yourpassword\]@localhost/postgres

In [2]:
%sql postgresql://postgres:example@db:5432

If you wish to reset your database and start over, you can run the cell below (this will delete **all** tables you have created!).
Important: Restarting this notebook or the whole docker container does not delete the tables.

In [48]:
%%sql
DROP TABLE IF EXISTS countries;
DROP TABLE IF EXISTS movies;
DROP TABLE IF EXISTS credits;
DROP TABLE IF EXISTS stars_in;
DROP TABLE IF EXISTS directed_by;
DROP TABLE IF EXISTS produced_by;
DROP TABLE IF EXISTS cards;
DROP TABLE IF EXISTS classes;
DROP TABLE IF EXISTS sets;
DROP TABLE IF EXISTS races;
DROP TABLE IF EXISTS minions;
DROP TABLE IF EXISTS abilities;
DROP TABLE IF EXISTS weapons;
DROP TABLE IF EXISTS playable_heroes;

 * postgresql://postgres:***@db:5432
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

**SQL Documentation (how to figure out the necessary synthax)**
- In some of the following tasks, we have linked to the official PostgreSQL documentation (e.g., the [CREATE TABLE command](https://www.postgresql.org/docs/14/static/sql-createtable.html)). While you may find help on platforms like stackoverflow, it is best to be able to read and understand the official documentation of PostgreSQL even if it may look complicated at first. This will enable you to understand all possible use-cases of an instruction and not just a specific example. If you prefer to learn by example, most documentation pages do contain a number of example when you scroll further down.
- Make sure to check out this [short guide](https://www.postgresql.org/docs/current/notation.html) on the formatting of the documentation. 
- If you want to find out how to do something in postgresql, you can use google and limit your search results to the official documentation (e.g., google "postgresql.org: create table") or use the [table of contents](https://www.postgresql.org/docs/14/index.html)
- Most of the documentation goes into more depth than we need. The most relevant chapters of the documentation are: _II. The SQL Language_ and _VI. Reference > I. SQL Commands_

**Now it is your turn!**
- Write SQL code to create the following ***countries*** table.  
  Select an appropriate SQL type for the domain of the attribute ***name***. We expect to store country names of at most 30 characters.  
  You may find this [link](https://www.postgresql.org/docs/14/static/sql-createtable.html) useful.
  
|name|
|:-:|
|string|

In [49]:
%%sql 
CREATE TABLE countries (name text);

 * postgresql://postgres:***@db:5432
Done.

[]

- Everytime you create/edit/delete a table in the database,  
  use the following command to see the results of your actions:  
  ```python
  %sql SELECT * FROM table_name
  ```

In [50]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
0 rows affected.

[]

- Write SQL code to insert the following tuple to the ***countries*** table.  
  You may find this [link](https://www.postgresql.org/docs/14/static/sql-insert.html) useful.  

|name|
|:-|
|Switzerland|

In [51]:
%%sql 
INSERT INTO countries VALUES ('Switzerland');

 * postgresql://postgres:***@db:5432
1 rows affected.

[]

If something failed in the previous step, you have likely created a table with the incorrect table or field name or with the wrong SQL type.
You can use
```
%%sql
DROP TABLE countries;
```
to delete the table and try again.

In [52]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
1 rows affected.

[('Switzerland',)]

* Check the table's contents.

In [53]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
1 rows affected.

[('Switzerland',)]

You should see a single tuple with the name 'Switzerland'.

- Write SQL code to insert the following tuples to the ***countries*** table.  
  Use a single SQL command to insert all the tuples.  
  
|name|
|:-|
|USA|
|Costa Rica|
|Iran|
|Kazakhstan|

In [54]:
%%sql 
INSERT INTO countries VALUES
('USA'), 
('Costa Rica'),
('Iran'),
('Kazakhstan')
;

 * postgresql://postgres:***@db:5432
4 rows affected.

[]

* Check the table contents again:

In [55]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
5 rows affected.

[('Switzerland',), ('USA',), ('Costa Rica',), ('Iran',), ('Kazakhstan',)]

There should now be the 6 tuples we inserted so far.

- Write SQL code to drop the ***countries*** table.  
  You may find this [link](https://www.postgresql.org/docs/14/static/sql-droptable.html) useful.

In [63]:
%%sql
DROP TABLE countries;

 * postgresql://postgres:***@db:5432
Done.

[]

- Write SQL code to create a ***countries*** table, with a single attribute ***name***, as before.  
  Use the SQL type *char(5)* for the domain of the ***name*** attribute.

In [64]:
%%sql 
CREATE TABLE countries (name char(5));

 * postgresql://postgres:***@db:5432
Done.

[]

* Check the contents.

In [65]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
0 rows affected.

[]

The table should now have a single attribute, 'name', and no tuples.

- Write SQL code to populate the ***countries*** table with the values below.  
  What result are you expecting?  
  
|name|
|:-|
|Switzerland|
|USA|
|Austria|
|Kazakhstan|
|Australia|

In [66]:
%%sql 
INSERT INTO countries VALUES
('Switzerland'),
('USA'), 
('Austria'),
('Kazakhstan'),
('Australia')
;

 * postgresql://postgres:***@db:5432
(psycopg2.errors.StringDataRightTruncation) value too long for type character(5)

[SQL: INSERT INTO countries VALUES
('Switzerland'),
('USA'),
('Austria'),
('Kazakhstan'),
('Australia')
;]
(Background on this error at: https://sqlalche.me/e/14/9h9h)

- You probably received an error stating that '... value too long for type character(5)'.  
  In practice, it often happens that the data to be inserted into a table do not fit the attribute domains properly. Although we should always strive to have a properly designed schema before inserting any data to our tables, there are legitimate cases where the data are malformed and it is better that they are formatted accordingly. Most database systems offer functionality towards that goal. For example, you can look at some functions that PostgreSQL offers for string manipulations [here](https://www.postgresql.org/docs/14/static/functions-string.html). You might be particularly interested in the function 'left(str text, n int)' in table 9-9.  
  Rewrite your last SQL command using the 'left' function, in order to overcome the above error.  
  What kind of result do you expect this time?

In [67]:
%%sql 
INSERT INTO countries VALUES
(left('Switzerland', 5)),
(left('USA', 5)), 
(left('Austria', 5)),
(left('Kazakhstan', 5)),
(left('Australia', 5))
;

 * postgresql://postgres:***@db:5432
5 rows affected.

[]

* Check the contents, it should match the following:

| name |
| :-: |
| Switz |
| USA |
| Austr |
| Kazak |
| Austr |

In [68]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
5 rows affected.

[('Switz',), ('USA  ',), ('Austr',), ('Kazak',), ('Austr',)]

- If you were expecting that there would be another error, because left('Austria', 5) is the same string as left('Australia', 5), then well done for remembering that tuples should be unique, but also welcome to the real world. Most database systems allow this in one way or another (it is not just PostgreSQL). We will see how we can actually enforce unique tuples next week.

- Insert a __second__ attribute to the ***countries*** table. Call it ***name*** and use the SQL type *CHAR(5)* again. Will it work?  
  You may find this [link](https://www.postgresql.org/docs/14/static/sql-altertable.html) useful.

In [69]:
%%sql 
ALTER TABLE countries ADD name char(5);

 * postgresql://postgres:***@db:5432
(psycopg2.errors.DuplicateColumn) column "name" of relation "countries" already exists

[SQL: ALTER TABLE countries ADD name char(5);]
(Background on this error at: https://sqlalche.me/e/14/f405)

* Check what's in the table now.

In [70]:
%%sql
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
5 rows affected.

[('Switz',), ('USA  ',), ('Austr',), ('Kazak',), ('Austr',)]

- Insert a __second__ attribute to the ***countries*** table. Call it ***name*** and use the SQL type *VARCHAR(30)* this time. What about this time?

In [71]:
%%sql 
ALTER TABLE countries ADD name varchar(30);

 * postgresql://postgres:***@db:5432
(psycopg2.errors.DuplicateColumn) column "name" of relation "countries" already exists

[SQL: ALTER TABLE countries ADD name varchar(30);]
(Background on this error at: https://sqlalche.me/e/14/f405)

- It seems that PostgreSQL will not allow you to have two attributes with the same name. Phew ... at least theory meets practice on this one! ;-)  
- Write SQL code to drop the existing ***name*** attribute in the ***countries*** table.

In [72]:
%%sql 
ALTER TABLE countries
DROP name;

 * postgresql://postgres:***@db:5432
Done.

[]

* Check the contents. You should see no tuples.

In [74]:
%%sql
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
5 rows affected.

[(), (), (), (), ()]

- Write the necessary SQL to __alter__ the ***countries*** table, so it has the attributes shown below.  
  Select SQL types that you think are appropriate for each of the attribute domains.  
  Try to select types that are not wasting too many bits/bytes, but that also allow all reasonable values for each attribute.  
  __Do not__ insert the tuples below into the table, but use them as a hint for the types that you should use.  
  You may consult PostgreSQL's [documentation](https://www.postgresql.org/docs/14/static/datatype-numeric.html).

|id|name|population|area [$km^2$]|gini|
|-:|:-|-:|-:|-:|
|number|string|number|number|number|
|1|China|1,403,500,365|9,596,961|46.1|
|2|Earth|7,442,100,000|510,072,000|-|

In [75]:
%%sql 
ALTER TABLE countries ADD id smallint;
ALTER TABLE countries ADD name varchar(30);
ALTER TABLE countries ADD population bigint;
ALTER TABLE countries ADD area bigint;
ALTER TABLE countries ADD gini decimal;

 * postgresql://postgres:***@db:5432
Done.
Done.
Done.
Done.
Done.

[]

* Check the contents again.

In [76]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
5 rows affected.

[(None, None, None, None, None),
 (None, None, None, None, None),
 (None, None, None, None, None),
 (None, None, None, None, None),
 (None, None, None, None, None)]

- Surprised by the result of SELECT? Maybe this is a hint of how PostgreSQL allows duplicate tuples in a table ...  
- Drop all attributes from the table ***countries***.

In [79]:
%%sql 
ALTER TABLE countries
DROP id;
ALTER TABLE countries
DROP name;
ALTER TABLE countries
DROP population;
ALTER TABLE countries
DROP area;
ALTER TABLE countries
DROP gini;

 * postgresql://postgres:***@db:5432
Done.
Done.
Done.
Done.
Done.

[]

In [80]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
5 rows affected.

[(), (), (), (), ()]

- Add the same attributes (***id***, ***name***, ***population***, ***area***, ***gini***) again to the table,  
  but this time place the constraint that ***id*** and ***name*** cannot be NULL. Allow the  
  rest attributes to take the NULL value.

In [81]:
%%sql 
ALTER TABLE countries ADD id smallint NOT NULL;
ALTER TABLE countries ADD name varchar(30) NOT NULL;
ALTER TABLE countries ADD population bigint;
ALTER TABLE countries ADD area bigint;
ALTER TABLE countries ADD gini decimal;

 * postgresql://postgres:***@db:5432
(psycopg2.errors.NotNullViolation) column "id" of relation "countries" contains null values

[SQL: ALTER TABLE countries ADD id smallint NOT NULL;]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

- It should be obvious by now that deleting all attributes of a table does not actually remove the extension,  
  at least not completely. Although the 'how' and 'why' are beyond the scope of this exercise, it is something  
  that is good to have in mind. To amend the above error, first try to delete the extension of the table and then  
  try to add the attributes again. You may find this [link](https://www.postgresql.org/docs/14/static/sql-delete.html) useful.

In [82]:
%%sql 
DELETE FROM countries;

 * postgresql://postgres:***@db:5432
5 rows affected.

[]

* Check the contents, you should see '0 rows affected.'

In [83]:
%%sql
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
0 rows affected.

[]

In [84]:
%%sql 
ALTER TABLE countries ADD id smallint NOT NULL;
ALTER TABLE countries ADD name varchar(30) NOT NULL;
ALTER TABLE countries ADD population bigint;
ALTER TABLE countries ADD area bigint;
ALTER TABLE countries ADD gini decimal;

 * postgresql://postgres:***@db:5432
Done.
Done.
Done.
Done.
Done.

[]

In [85]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
0 rows affected.

[]

- Populate the ***countries*** table with the following values:  

|id|name|population|area [$km^2$]|gini|
|-:|:-|-:|-:|-:|
|1|Switzerland|8401120|41285|29.5|
|2|USA|325365189|9833520|40.8|
|3|Cost Rica|4857274|51000|40.7|
|4|Iran|80829192|1648195|37.4|
|5|Kazakhstan|17987736|2724900|26.4|

In [86]:
%%sql 
INSERT INTO countries
    (id, name, population, area, gini) 
VALUES
    (1, 'Switzerland', 8401120, 41285, 29.5), 
    (2, 'USA', 325365189, 9833520, 40.8), 
    (3, 'Cost Rica', 4857274, 51000, 40.7), 
    (4, 'Iran', 80829192, 1648195, 37.4), 
    (5, 'Kazakhstan', 17987736, 2724900, 26.4);

 * postgresql://postgres:***@db:5432
5 rows affected.

[]

In [87]:
%%sql 
SELECT * FROM countries;

 * postgresql://postgres:***@db:5432
5 rows affected.

[(1, 'Switzerland', 8401120, 41285, Decimal('29.5')),
 (2, 'USA', 325365189, 9833520, Decimal('40.8')),
 (3, 'Cost Rica', 4857274, 51000, Decimal('40.7')),
 (4, 'Iran', 80829192, 1648195, Decimal('37.4')),
 (5, 'Kazakhstan', 17987736, 2724900, Decimal('26.4'))]

- Try to create a second table named ***countries*** but with the attributes  ***name*** and ***continent*** and suitable domains. Will it work?

In [88]:
%%sql 
CREATE TABLE countries (
    name varchar(30),
    continent varchar(30)
);

 * postgresql://postgres:***@db:5432
(psycopg2.errors.DuplicateTable) relation "countries" already exists

[SQL: CREATE TABLE countries (
    name varchar(30),
    continent varchar(30)
);]
(Background on this error at: https://sqlalche.me/e/14/f405)

- If you have followed all the previous steps, then this leads to an error because you have already created a table named ***countries*** even though the attributes are different. This is also the reason why in the beginning we reset the database by running the commands `DROP TABLE IF EXISTS ...`.

- Create the following ***movies*** table:   
  
|title |year   |length |  
|:----:|:-----:|:-----:|  
|string|integer|integer|  

Constraints:
- ***title*** and ***year*** cannot be NULL
- ***length*** has default value 120 [link](https://www.postgresql.org/docs/12/static/ddl-default.html)

In [94]:
%%sql
DROP TABLE IF EXISTS movies;

 * postgresql://postgres:***@db:5432
Done.

[]

In [95]:
%%sql
CREATE TABLE movies (
    title varchar(30) NOT NULL,
    year smallint NOT NULL,
    length smallint
)

 * postgresql://postgres:***@db:5432
Done.

[]

- Populate the ***movies*** table:

|title|year|length|
|----:|:--:|:----:|
|Bladerunner|1982|117|
|Arrival|2016|116| 
|La La Land|2016|128|  
|Bladerunner 2049|2017|163|

In [96]:
%%sql
INSERT INTO movies
    (title, year, length) 
VALUES 
    ('Bladerunner', 1982, 117),
    ('Arrival', 2016, 116),
    ('La La Land', 2016, 128),
    ('Bladerunner 2049', 2017, 163);

 * postgresql://postgres:***@db:5432
4 rows affected.

[]

In [97]:
%sql SELECT * FROM movies;

 * postgresql://postgres:***@db:5432
4 rows affected.

[('Bladerunner', 1982, 117),
 ('Arrival', 2016, 116),
 ('La La Land', 2016, 128),
 ('Bladerunner 2049', 2017, 163)]

- Add to the table ***movies*** the attribute ***genre***, with domain a string of up to 20 characters, with the constraint that it cannot be NULL.  
  Will this work?

In [98]:
%%sql 
ALTER TABLE movies ADD genre char(20) NOT NULL;

 * postgresql://postgres:***@db:5432
(psycopg2.errors.NotNullViolation) column "genre" of relation "movies" contains null values

[SQL: ALTER TABLE movies ADD genre char(20) NOT NULL;]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

- Do you understand why the command failed? (hint: check the actual error at the end of the traceback)   
  Let's try again. Try to add the attribute ***genre*** again, but this time set its default value to be 'Drama'.

In [99]:
%%sql 
ALTER TABLE movies ADD genre char(20) DEFAULT 'Drama';

 * postgresql://postgres:***@db:5432
Done.

[]

* Check the contents, you should get this output:

| title	| year	| length	| genre |
| ----: | :-: | :-: | :-: |
| Bladerunner	| 1982	| 117	| Drama |
| Arrival	| 2016	| 116	| Drama |
| La La Land	| 2016	| 128	| Drama |
| Bladerunner 2049	| 2017	| 163	| Drama |

In [100]:
%%sql 
SELECT * FROM movies;

 * postgresql://postgres:***@db:5432
4 rows affected.

[('Bladerunner', 1982, 117, 'Drama               '),
 ('Arrival', 2016, 116, 'Drama               '),
 ('La La Land', 2016, 128, 'Drama               '),
 ('Bladerunner 2049', 2017, 163, 'Drama               ')]

- __Update__ the extension of the ***movies*** table, in order to get the following result (check [this](https://www.postgresql.org/docs/14/static/sql-update.html)):  

|title|year|length|genre| 
|----:|:--:|:----:|:---:|  
|Bladerunner|1982|117|Thriller|  
|Arrival|2016|116|Sci-Fi|  
|La La Land|2016|128|Drama|  
|Bladerunner 2049|2017|163|Thriller|

In [101]:
%%sql
UPDATE movies 
SET genre = 'Thriller' WHERE title = 'Bladerunner';
UPDATE movies 
SET genre = 'Sci-Fi' WHERE title = 'Arrival';
UPDATE movies 
SET genre = 'Drama' WHERE title = 'La La Land';
UPDATE movies 
SET genre = 'Thriller' WHERE title = 'Bladerunner 2049';

 * postgresql://postgres:***@db:5432
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [102]:
%%sql 
SELECT * FROM movies;

 * postgresql://postgres:***@db:5432
4 rows affected.

[('Bladerunner', 1982, 117, 'Thriller            '),
 ('Arrival', 2016, 116, 'Sci-Fi              '),
 ('La La Land', 2016, 128, 'Drama               '),
 ('Bladerunner 2049', 2017, 163, 'Thriller            ')]

- Create the following ***credits*** table:  
   
|name  |birthdate|
|:----:|:-------:|
|string|date     |  

Constraints:
- ***name*** cannot be NULL
- ***birthdate*** can be NULL

In [103]:
%%sql
CREATE TABLE credits (
    name varchar(30) NOT NULL,
    birthdate date
)

 * postgresql://postgres:***@db:5432
Done.

[]

- Change the ***birthdate*** attribute to have a default value of 1st of January, 1970.

In [105]:
%%sql 
ALTER TABLE credits
ALTER birthdate SET DEFAULT '1970-01-01';

 * postgresql://postgres:***@db:5432
Done.

[]

- Populate the ***credits*** table:  

|name|birthdate|
|----------:|:-------:|
|Denis Villeneuve|03.10.1967|
|Amy Adams|20.08.1974|
|Ryan Gosling|12.11.1980|
|Harrison Ford|13.07.1942|
|Ridley Scott|30.11.1937|
|Emma Stone|06.11.1988|
|Rutger Hauer|-|
|Sean Young|20.11.1959|

In [106]:
%%sql
INSERT INTO credits
    (name, birthdate) 
VALUES 
    ('Denis Villeneuve', '1967-10-03'), 
    ('Amy Adams', '1974-08-20'), 
    ('Ryan Gosling', '1980-11-12'), 
    ('Harrison Ford', '1942-07-12'), 
    ('Ridley Scott', '1937-11-30'), 
    ('Emma Stone', '1988-11-06'), 
    ('Rutger Hauer', DEFAULT), 
    ('Sean Young', '1959-11-20');

 * postgresql://postgres:***@db:5432
8 rows affected.

[]

In [107]:
%%sql 
SELECT * FROM credits;

 * postgresql://postgres:***@db:5432
8 rows affected.

[('Denis Villeneuve', datetime.date(1967, 10, 3)),
 ('Amy Adams', datetime.date(1974, 8, 20)),
 ('Ryan Gosling', datetime.date(1980, 11, 12)),
 ('Harrison Ford', datetime.date(1942, 7, 12)),
 ('Ridley Scott', datetime.date(1937, 11, 30)),
 ('Emma Stone', datetime.date(1988, 11, 6)),
 ('Rutger Hauer', datetime.date(1970, 1, 1)),
 ('Sean Young', datetime.date(1959, 11, 20))]

- Rutger Hauer was born on the 23rd of January, 1944. Update the ***credits*** table accordingly.

In [108]:
%%sql 
UPDATE credits 
SET birthdate = '1944-01-23' WHERE name = 'Rutger Hauer';

 * postgresql://postgres:***@db:5432
1 rows affected.

[]

In [109]:
%%sql 
SELECT * FROM credits;

 * postgresql://postgres:***@db:5432
8 rows affected.

[('Denis Villeneuve', datetime.date(1967, 10, 3)),
 ('Amy Adams', datetime.date(1974, 8, 20)),
 ('Ryan Gosling', datetime.date(1980, 11, 12)),
 ('Harrison Ford', datetime.date(1942, 7, 12)),
 ('Ridley Scott', datetime.date(1937, 11, 30)),
 ('Emma Stone', datetime.date(1988, 11, 6)),
 ('Sean Young', datetime.date(1959, 11, 20)),
 ('Rutger Hauer', datetime.date(1944, 1, 23))]

- Create the following ***stars_in*** table:

|movie_title|movie_year|star_name|
|:--------:|:-------:|:--------|
|string    |integer  |string   |  

Constraints:
- None of the attributes may be NULL

In [111]:
%%sql
CREATE TABLE stars_in (
    movie_title char(40) NOT NULL,
    movie_year smallint NOT NULL,
    star_name char(40) NOT NULL
)

 * postgresql://postgres:***@db:5432
Done.

[]

- Populate the ***stars_in*** table:

|movie_title|movie_year|star_name|
|---------:|:-------:|:-------|
|Arrival|2016|Amy Adams|
|La La Land|2016|Ryan Gosling|
|La La Land|2016|Emma Stone|
|Bladerunner|1982|Rutger Hauer|
|Bladerunner|1982|Harrison Ford|
|Bladerunner|1982|Sean Young|
|Bladerunner 2049|2017|Ryan Gosling|
|Bladerunner 2049|2017|Harrison Ford|

In [112]:
%%sql
INSERT INTO stars_in
    (movie_title, movie_year, star_name) 
VALUES 
    ('Arrival', 2016, 'Amy Adams'), 
    ('La La Land', 2016, 'Ryan Gosling'), 
    ('La La Land', 2016, 'Emma Stone'), 
    ('Bladerunner', 1982, 'Rutger Hauer'), 
    ('Bladerunner', 1982, 'Harrison Ford'), 
    ('Bladerunner', 1982, 'Sean Young'), 
    ('Bladerunner 2049', 2017, 'Ryan Gosling'), 
    ('Bladerunner 2049', 2017, 'Harrison Ford');

 * postgresql://postgres:***@db:5432
8 rows affected.

[]

In [113]:
%%sql 
SELECT * FROM stars_in;

 * postgresql://postgres:***@db:5432
8 rows affected.

[('Arrival                                 ', 2016, 'Amy Adams                               '),
 ('La La Land                              ', 2016, 'Ryan Gosling                            '),
 ('La La Land                              ', 2016, 'Emma Stone                              '),
 ('Bladerunner                             ', 1982, 'Rutger Hauer                            '),
 ('Bladerunner                             ', 1982, 'Harrison Ford                           '),
 ('Bladerunner                             ', 1982, 'Sean Young                              '),
 ('Bladerunner 2049                        ', 2017, 'Ryan Gosling                            '),
 ('Bladerunner 2049                        ', 2017, 'Harrison Ford                           ')]

- Create the following ***directed_by*** table:

|movie_title|movie_year|director_name|
|:--------:|:-------:|:----------:|
|string    |integer  |string      |  

Constraints:
- None of the attributes may be NULL

In [114]:
%%sql
CREATE TABLE directed_by (
    movie_title char(40) NOT NULL,
    movie_year smallint NOT NULL,
    director_name char(40) NOT NULL
)

 * postgresql://postgres:***@db:5432
Done.

[]

- Populate the ***directed_by*** table:  

|movie_title|movie_year|director_name|
|---------:|:-------:|:-------|
|Arrival|2016|Denis Villeneuve|
|Bladerunner|1982|Ridley Scott|
|Bladerunner 2049|2017|Denis Villeneuve|

In [115]:
%%sql
INSERT INTO directed_by
    (movie_title, movie_year, director_name) 
VALUES 
    ('Arrival', 2016, 'Denis Villeneuve'), 
    ('Blade Runner', 1982, 'Ridley Scott'), 
    ('Blade Runner 2049', 2017, 'Denis Villeneuve');

 * postgresql://postgres:***@db:5432
3 rows affected.

[]

In [116]:
%%sql 
SELECT * FROM directed_by;

 * postgresql://postgres:***@db:5432
3 rows affected.

[('Arrival                                 ', 2016, 'Denis Villeneuve                        '),
 ('Blade Runner                            ', 1982, 'Ridley Scott                            '),
 ('Blade Runner 2049                       ', 2017, 'Denis Villeneuve                        ')]

- Create the ***produced_by*** table:

|movie_title|movie_year|producer_name|
|:--------:|:-------:|:----------:|
|string    |integer  |string      |  

Constraints:
- None of the attributes may be NULL

In [117]:
%%sql
CREATE TABLE produced_by (
    movie_title char(40) NOT NULL,
    movie_year smallint NOT NULL,
    producer_name char(40) NOT NULL
)

 * postgresql://postgres:***@db:5432
Done.

[]

- Populate the ***produced_by*** table:  

|movie_title|movie_year|producer_name|
|---------:|:-------:|:-------|
|Bladerunner 2049|2017|Ridley Scott|

In [118]:
%%sql 
INSERT INTO produced_by
    (movie_title, movie_year, producer_name) 
VALUES 
    ('Blade Runner 2049', 2017, 'Ridley Scott');

 * postgresql://postgres:***@db:5432
1 rows affected.

[]

In [119]:
%%sql 
SELECT * FROM produced_by;

 * postgresql://postgres:***@db:5432
1 rows affected.

[('Blade Runner 2049                       ', 2017, 'Ridley Scott                            ')]

### *From here on it is only optional to solve the exercises as there are no new concepts*

- Create the following ***cards*** table:  

|id|name|
|-:|:-|
|integer|string|  

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***cards*** table:

|id|name|
|-:|:-|
|1|Explosive Trap|
|2|Crackle|
|3|Ysera|
|4|Mechanical Yeti|
|5|Frost Lich Jaina|
|6|Lord Jaraxxus|
|7|Gorehowl|
|8|Drakonid Operator|
|9|Kvaldir Raider
|10|Zombie Chow|
|11|Murloc Tinyfin|
|12|Grim Patron|

In [ ]:
%%sql
INSERT INTO cards
    (id, name) 
VALUES
    (1, 'Explosive Trap'),
    (2, 'Crackle'),
    (3, 'Ysera'),
    (4, 'Mechanical Yeti'),
    (5, 'Frost Lich Jaina'),
    (6, 'Lord Jaraxxus'),
    (7, 'Gorehowl'),
    (8, 'Drakonid Operator'),
    (9, 'Kvaldir Raider'),
    (10, 'Zombie Chow'),
    (11, 'Murloc Tinyfin'),
    (12, 'Grim Patron');

In [ ]:
%%sql 
SELECT * FROM cards;

- Create the following ***classes*** table:  

|name|
|:-|
|string|

Constraints:
- ***name*** cannot be NULL

In [ ]:
%%sql

- Populate the ***classes*** table:  

|name|
|:-|
|Neutral|
|Druid|
|Hunter|
|Mage|
|Paladin|
|Priest|
|Rogue|
|Shaman|
|Warlock|
|Warrior|

In [ ]:
%%sql
INSERT INTO classes
    (name) 
VALUES
    ('Neutral'), 
    ('Druid'), 
    ('Hunter'),
    ('Mage'), 
    ('Paladin'), 
    ('Priest'),
    ('Rogue'), 
    ('Shaman'), 
    ('Warlock'), 
    ('Warrior');

In [ ]:
%%sql 
SELECT * FROM classes;

- Create the following ***sets*** table:  

|name|
|:-|
|string|

Constraints:
- ***name*** cannot be NULL

In [ ]:
%%sql

- Populate the ***sets*** table:  

|name|
|:-|
|Basic|
|Expert|
|Curse of Naxxramas|
|Goblins vs Gnomes|
|Blackrock Mountain|
|The Grand Tournament|
|League of Explorers|
|Whispers of the Old Gods|
|Mean Streets of Gadgetzan|
|One Night in Karazhan|
|Journey to Un'Goro|
|Knights of the Frozen Throne|

In [ ]:
%%sql
INSERT INTO sets
    (name) 
VALUES
    ('Basic'), 
    ('Expert'), 
    ('Curse of Naxxramas'),
    ('Goblins vs Gnomes'), 
    ('Blackrock Mountain'), 
    ('The Grand Tournament'),
    ('League of Explorers'), 
    ('Whispers of the Old Gods'), 
    ('Mean Streets of Gadgetzan'),
    ('One Night in Karazhan'), 
    ('Journey to Un''Goro'), 
    ('Knights of the Frozen Throne');

In [ ]:
%%sql 
SELECT * FROM sets;

- Create the following ***races*** table:  

|name|
|:-|
|string|

Constraints:
- ***name*** cannot be NULL

In [ ]:
%%sql

- Populate the ***races*** table:  

|name|
|:-|
|Beast|
|Elemental|
|Demon|
|Dragon|
|Mech|
|Murloc|
|Pirate|
|Totem|

In [ ]:
%%sql
INSERT INTO races
    (name) 
VALUES
    ('Beast'), 
    ('Elemental'), 
    ('Demon'),
    ('Dragon'), 
    ('Mech'), 
    ('Murloc'), 
    ('Pirate'), 
    ('Totem');

In [ ]:
%%sql 
SELECT * FROM races;

- Create the following ***minions*** table: 

|name|mana|attack|health|race|class|set|
|:-|-:|-:|-:|:-|:-|:-|
|string|integer|integer|integer|string|string|string|

Constraints:
- ***race*** can be NULL
- No other attribute may be NULL

In [ ]:
%%sql

- Populate the ***minions*** table:

|name|mana|attack|health|race|class|set|
|:-|-:|-:|-:|:-|:-|:-|
|Ysera|9|4|12|Dragon|Neutral|Expert|
|Mechanical Yeti|4|4|5|Mech|Neutral|Goblins vs Gnomes|
|Lord Jaraxxus|9|3|15|Demon|Warlock|Expert|
|Drakonid Operator|5|5|6|Dragon|Priest|Mean Streets of Gadgetzan|
|Kvaldir Raider|5|4|4|-|Neutral|The Grand Tournament|
|Zombie Chow|1|2|3|-|Neutral|Curse of Naxxramas|
|Murloc Tinyfin|0|1|1|Murloc|Neutral|League of Explorers|
|Grim Patron|5|3|3|-|Neutral|Blackrock Mountain|

In [ ]:
%%sql
INSERT INTO minions
    (name, mana, attack, health, race, class, set) 
VALUES
    ('Ysera', 9, 4, 12, 'Dragon', 'Neutral', 'Expert'),
    ('Mechanical Yeti', 4, 4, 5, 'Mech', 'Neutral', 'Goblins vs Gnomes'),
    ('Lord Jaraxxus', 9, 3, 15, 'Demon', 'Warlock', 'Expert'), 
    ('Drakonid Operator', 5, 5, 6, 'Dragon', 'Priest', 'Mean Streets of Gadgetzan'), 
    ('Kvaldir Raider', 5, 4, 4, DEFAULT, 'Neutral', 'The Grand Tournament'), 
    ('Zombie Chow', 1, 2, 3, DEFAULT, 'Neutral', 'Curse of Naxxramas'),
    ('Murloc Tinyfin', 0, 1, 1, 'Murloc', 'Neutral', 'League of Explorers'),
    ('Grim Patron', 5, 3, 3, DEFAULT, 'Neutral', 'Blackrock Mountain');

In [ ]:
%%sql 
SELECT * FROM minions;

- Create the following ***abilities*** table:  

|name|mana|class|set|
|:-|-:|:-|:-|
|string|integer|string|string|

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***abilities*** table:  

|name|mana|class|set|
|:-|-:|:-|:-|
|Explosion Trap|2|Hunter|Expert|
|Crackle|2|Shaman|Goblins vs Gnomes|
|Mind Control|10|Priest|Basic|

In [ ]:
%%sql
INSERT INTO abilities
    (name, mana, class, set) 
VALUES
    ('Explosive Trap', 2, 'Hunter', 'Expert'),
    ('Crackle', 2, 'Shaman', 'Goblins vs Gnomes'),
    ('Mind Control', 10, 'Priest', 'Basic');

In [ ]:
%%sql 
SELECT * FROM abilities;

- Create the following ***weapons*** table:  

|name|mana|attack|durability|class|set|
|:-|-:|-:|-:|:-|:-|
|string|integer|integer|integer|string|string|

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***weapons*** table:  

|name|mana|attack|durability|class|set|
|:-|-:|-:|-:|:-|:-|
|Gorehowl|7|7|1|Warrior|Expert|

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM weapons;

- Create the following ***playable_heroes*** table:  

|name|mana|class|set|
|:-|-:|:-|:-|
|string|integer|string|string|

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***playable_heroes*** table:  

|name|mana|class|set|
|:-|-:|:-|:-|
|Frost Lich Jaina|9|Mage|Knights of the Frozen Throne|

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM playable_heroes;